In [2]:
import pandas as pd 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [3]:
df.head()   # first 2 rows

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [4]:
df.tail(2)  # last 2 rows

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [5]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [7]:
import numpy as np
ser = pd.Series(np.random.rand(5))
print(ser)

0    0.403520
1    0.287981
2    0.099400
3    0.068492
4    0.246831
dtype: float64

In [17]:
import numpy as np
import pandas as pd

# Create a DataFrame with random floats
newdf = pd.DataFrame(np.random.rand(5, 3), index=np.arange(5), columns=['A', 'B', 'C'])
print("Initial DataFrame:")
print(newdf)

print("\nType of DataFrame:")
print(type(newdf))

print("\nData types of columns:")
print(newdf.dtypes)

newdf.loc[0, 'A'] = "bhumi" 
print("\nData types after assignment:")
print(newdf.dtypes) 

print("\nDataFrame after assignment:")
print(newdf.head())

Initial DataFrame:
          A         B         C
0  0.703754  0.445973  0.945573
1  0.840580  0.398202  0.606045
2  0.779731  0.937273  0.159495
3  0.667783  0.784341  0.077926
4  0.310020  0.181426  0.252118

Type of DataFrame:
<class 'pandas.core.frame.DataFrame'>

Data types of columns:
A    float64
B    float64
C    float64
dtype: object

Data types after assignment:
A     object
B    float64
C    float64
dtype: object

DataFrame after assignment:
          A         B         C
0     bhumi  0.445973  0.945573
1   0.84058  0.398202  0.606045
2  0.779731  0.937273  0.159495
3  0.667783  0.784341  0.077926
4   0.31002  0.181426  0.252118

C:\Users\DREAMWORLD\AppData\Local\Temp\ipykernel_1776\1576269056.py:18: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'bhumi' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf.loc[0, 'A'] = "bhumi"  # Use .loc to assign the value

In [18]:
newdf.index

Index([0, 1, 2, 3, 4], dtype='int64')

In [19]:
newdf.columns

Index(['A', 'B', 'C'], dtype='object')

In [20]:
newdf.sort_index()

          A         B         C
0     bhumi  0.445973  0.945573
1   0.84058  0.398202  0.606045
2  0.779731  0.937273  0.159495
3  0.667783  0.784341  0.077926
4   0.31002  0.181426  0.252118

In [22]:
newdf.loc[0]  # first column

A       bhumi
B    0.445973
C    0.945573
Name: 0, dtype: object